yuukiokamiya/QCS_Silicon_Partners/ek_ra6m4_sensordummy_da16200_freertos_adafruit_cloud/src/sensor_thread_entry.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
#include "hal_data.h"
#include "sensor_thread.h"
#include "user.h"
#include "common_utils.h"
#include <stdio.h>
/*Start adding @INCLUDES code */
/*End adding @INCLUDES code */

/******************************************************************************
 User function prototype declarations
 *******************************************************************************/
/*Start adding @FN_DECLARATION code */
/*End adding @FN_DECLARATION code */

/******************************************************************************
 User global variables
 *******************************************************************************/
/*Start adding @GLOBAL_VARIABLES code */
/*End adding @GLOBAL_VARIABLES code */
extern TaskHandle_t sensor_thread;
QueueHandle_t g_sensor_queue;

void g_comms_i2c_bus0_quick_setup(void);

/* Sensor Thread entry function */
/* pvParameters contains TaskHandle_t */
void sensor_thread_entry(void *pvParameters) {

	g_comms_i2c_bus0_quick_setup();

	g_sensor_queue = xQueueCreate(20, SENSOR_DATA_COUNT * sizeof(float));

/*Start adding @MAIN_INITIALIZATION code */
	float dummy_data;
	g_dummy_quick_setup();
/*End adding @MAIN_INITIALIZATION code */

	vTaskSuspend(sensor_thread);

	/* TODO: add your own code here */
	while (1) {
/*Start adding @MAIN_LOOP code */
		g_dummy_sensor0_read(&dummy_data);
		float data[SENSOR_DATA_COUNT] = { dummy_data };
/*End adding @MAIN_LOOP code */
		xQueueSend(g_sensor_queue, (uint32_t*) data, 0);
		vTaskDelay(pdMS_TO_TICKS(30000));
	}

	FSP_PARAMETER_NOT_USED(pvParameters);
}

/* Quick setup for g_comms_i2c_bus0. */
void g_comms_i2c_bus0_quick_setup(void) {
	fsp_err_t err;
	i2c_master_instance_t *p_driver_instance =
			(i2c_master_instance_t*) g_comms_i2c_bus0_extended_cfg.p_driver_instance;

	/* Open I2C driver, this must be done before calling any COMMS API */
	err = p_driver_instance->p_api->open(p_driver_instance->p_ctrl,
			p_driver_instance->p_cfg);
	assert(FSP_SUCCESS == err);

#if BSP_CFG_RTOS
    /* Create a semaphore for blocking if a semaphore is not NULL */
    if (NULL != g_comms_i2c_bus0_extended_cfg.p_blocking_semaphore)
    {
#if BSP_CFG_RTOS == 1 // AzureOS
        tx_semaphore_create(g_comms_i2c_bus0_extended_cfg.p_blocking_semaphore->p_semaphore_handle,
                            g_comms_i2c_bus0_extended_cfg.p_blocking_semaphore->p_semaphore_name,
                            (ULONG)0);
#elif BSP_CFG_RTOS == 2 // FreeRTOS
        *(g_comms_i2c_bus0_extended_cfg.p_blocking_semaphore->p_semaphore_handle) = xSemaphoreCreateCountingStatic((UBaseType_t)1, (UBaseType_t)0, g_comms_i2c_bus0_extended_cfg.p_blocking_semaphore->p_semaphore_memory);
#endif
    }

    /* Create a recursive mutex for bus lock if a recursive mutex is not NULL */
    if (NULL != g_comms_i2c_bus0_extended_cfg.p_bus_recursive_mutex)
    {
#if BSP_CFG_RTOS == 1 // AzureOS
        tx_mutex_create(g_comms_i2c_bus0_extended_cfg.p_bus_recursive_mutex->p_mutex_handle,
                        g_comms_i2c_bus0_extended_cfg.p_bus_recursive_mutex->p_mutex_name,
                        TX_INHERIT);
#elif BSP_CFG_RTOS == 2 // FreeRTOS
        *(g_comms_i2c_bus0_extended_cfg.p_bus_recursive_mutex->p_mutex_handle) = xSemaphoreCreateRecursiveMutexStatic(g_comms_i2c_bus0_extended_cfg.p_bus_recursive_mutex->p_mutex_memory);
#endif
    }
#endif
}

/*Start adding @FN_IMPLEMENTATION code */
/*End adding @FN_IMPLEMENTATION code */